Revit 2024 API
ExportEnergyModelType Enumeration
 This enum is used to define if energy model used for gbXML export should be based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public enum ExportEnergyModelType
Visual Basic
Public Enumeration ExportEnergyModelType
Visual C++
public enum class ExportEnergyModelType
Members
Member name | Description
SpatialElement |  Energy model based on rooms or spaces.
BuildingElement |  The building element based energy analytical model.
AnalysisMode |  Energy model based on analysis mode in EnergyDataSettings.
See Also
Autodesk.Revit.DB Namespace